---
title: OpenShift the free PaaS by Red Hat
slug: openshift-the-free-paas-by-red-hat
create_date: 2012-06-09 17:12:42
tags: 
updates:
  username: 12
  date: 2012-06-09 17:12:42
  comment: Initial import of post from WP
---
If you haven't heard of OpenShift by now, then you're definitely living in the dark ages. OpenShift is Red Hat's Cloud Computing Platform as a Service (PaaS). It is an application platform in the cloud, which allows developers and team to build, test, deploy and run their applications. This saves you from having to take care of the infrastructure, middleware and even management and which then in turn allows developers to focus on what really matters... designing and coding applications.  Getting started with OpenShift is extremely easy and to start simply navigate to their sign up page and get yourself a free account:&nbsp;[https://openshift.redhat.com/app/account/new](http://www.linuxdigest.org/wp-content/uploads/new)  Once you have your own account and you're signed in you are ready to create your first application. Just simply click on the add application button and you will see many different options from instant applications to do it yourself setups. I would suggest to pick a do it yourself set up to start out with so you can get to know OpenShift and get the full experience. The base application such as PHP, JBoss, Ruby, Python, Perl, etc. are called cartridges, which is the heart of your application. Once you have your cartridge set up you then can add more cartridges to your application such as MySQL, Cron, phpMyAdmin, etc.  This is when the fun really begins. You are now ready to get your application onto your new platform. The first thing from this point that you should do is add your public key to your account which will allow you to connect to the server or git repository without having to use a password. To add your key, log into your account and then click on the "My Account" tab and then on the right hand side you will see a "Public Keys" section and that is where you can add it.  Now all you have to do is clone the current git repository and then commit/push your code and start working on your application. There is a really awesome getting started tutorial (the link is on the right hand side when you log into your account and select one of your applications). This link will show you how to use git and how to manage your application. There is also a very helpful user guide which can be found here:&nbsp;[http://docs.redhat.com/docs/en-US/OpenShift/2.0/html/User\_Guide/index.html](http://www.linuxdigest.org/wp-content/uploads/index.html)  So get started with OpenShift today!

