---
title: CodeGuard Website Backup (Free & Premium) Review
slug: review-codeguard-website-backup
create_date: 2012-07-03 03:23:41
tags: 
updates:
  username: 12
  date: 2012-07-03 03:23:41
  comment: Initial import of post from WP
---
Everyone at some point has done it, or will do it. You create a website, get it running, start writing articles or content for the website and all is going well until that dreaded moment happens. It can be a slew of different scenarios such as, the hosting provider that you have been using decided to not be in business anymore, or you happen to type "rm -rf ~" in the command prompt (yes, not my famous moment), or the co-maker of your website says that he is going to back up your forum and posts and then you trust that he will do it and it never happens and you forget to pay your VPS bill and all of your content gets deleted from it and you ask the co-maker of the site if he ever finished that backup script.. and he tells you no.. OK, that story was a bit elaborate and it was completely made up... or was it? I'll let you decide.  In any case, to prevent that from happening you need to back up your stuff. Sure, you could use my other script posted on here to backup all the files and database of your server (click [HERE](http://www.linuxdigest.org/2012/06/automate-server-backups-to-amazon-s3/ "Automate server backups to Amazon S3") to view that post) or you can make your life even easier and use one of the best cloud site backup sites out there, CodeGuard. CodeGuard takes all the hassle and stress away from backing up what really matters, your content. It also keeps previous versions and lets you know what has been changed since the last backup and that notification even comes in via an email.  Now there are plugins for many different CMS/ type of sites such as Drupal, Joomla, Magento and what we will talk about, Wordpress. You can literally automate your full wordpress site backups in less than 5 minutes and in only a few clicks. To get started simply head over to [CodeGuard.com](http://www.linuxdigest.org/wp-content/uploads/www.codeguard.com) and sign up for an account. Once you have an account, either go into your WP-Admin and go to Plugins and click add new plugin and search for codeguard or simply go to the [WordPress download page](http://www.linuxdigest.org/wp-content/uploads/wordpress) and download and install the plugin and that's it. You're all set. **The Interface**  After you've done all that you'll need to wait roughly 24 hours for your first backup to take place (mine only took about 7 hours before it was completed and set up). After that when you log into their site you will get a lot of great information about your backups and a pretty little interface like the one shown to the left.  The features when you log in are very easy to navigate and pretty straight forward, you have a Backup, Restore, and Settings tab on the left hand side of the page. On the backup page it shows you information about your backup including the different file types and how many of each are inside the backup. It will also tell you how long until they take the next backup snapshot of your website.  I really have to give them props for their interface because it is extremely simple to navigate through and even a novice could do everything they needed to do in it. There are too many sites out there today that are over complicated and it takes more time figuring out the site than what you really want to do.  One other addition, is the email notifications that let you know what files have been changed and when. This is a quick way to know that updates or changes have been made to your website, and it should be a red flag if you didn't change anything on your site within that time frame. **Restoring**  The restoration process is extremely easy as well, however I did notice that it took about 20 minutes for it to send me the zip file of the restore. This could possibly be from me being only a free member and not a paid member. I also tried the restore directly to the site feature and it failed on permissions and I didn't even bother looking into why that happened because the zip file was more than what I needed. Even with the zip file taking 20 minutes to get to me, it still saved me from having to re-find the images and posts that I made on my site and I will definitely become a paid member very shortly.  Issues happen at the worst possible times, and you need to make sure you are constantly backed up in multiple locations. CodeGuard is definitely one of the best places to backup your wordpress website as well as most any other CMS or website. What is really awesome as well, is you can specify the backup frequency, and the options are Never, Daily, Weekly, or Monthly.  So get your website protected today, and sign up for free with CodeGuard to try it out. You definitely will not regret it. [www.codeguard.com](http://www.linuxdigest.org/wp-content/uploads/www.codeguard.com)

